#!/usr/bin/env python2
# -*- coding: utf-8 -*-

import pygsheets

test_message="""學出來心原一空且

現小球物以西已三想傷細都意是手；長問專仍朋心過師時，子然保我五不已市正歌更為故作會來自一食了年，己省野的我月火那而參天望！

臺手想數果級，金世高招保定放關可後兒處我務，萬以來們紀在說漸計統專把考。

境信玩裡產景示無家神必讀教看府子他住國子只引空來在料來反動用防白裡到仍張價共；是且子星自紅高福，裝對石使作全施？

爭趣點今統願樹著導不夠見反不說有？費天我足觀的參拉接作子以解也報未的：層建孩民：母了會刻今消標叫百安消起前價，好時說富；美她話投中們事。

現但怎以裡己很構正，少客你亞興能的的車這大流中美而化保部是是面才他金？

遊所門：記家一式受養量汽落老隨邊；另的新經些認會了持一重劇天量，出有痛商用；其一都向……和多根特紅紅不力，熱小了們動開真林讓過習？造臺不；物進在參此總氣成這味人物是教認，神確找且此！的以慢雖辦小告一無；對不的是入了簡我的有中來過人甚中能背，上法程的！媽標樹劇還治每考三進我不往負在給？無那南來腦好能形笑她麼排資代息得笑快如大歌求速使保接現童如，眼住考學濟年頭像護。主利西次不情？裡小家不灣景動：上行聲：孩就親下美近坡小銷這目？屋識我充技合民海報西上三失或育大主進望球考我小人小會我一。時大料以指是已活就得南自見加生度，上業治中，空是古地這……排部已中具部人且能實政市，要海不庭不照野？本先期臉。命獲英。為對現無功通我電紅大電冷，即在學委再了到不假實。

人他心由她本是晚買裝度，性沒往其裡要口王股，價過著運。人畫社？校在那也，刻近差，獨童星金會功因歡國系山的體腦食較白著種：同來解：心跑務足富看為！更流安形國受不、是評絕告手學超的孩物受工種組預專言社司政舞層的生財險去子選線？

來統點；一變把！自趣究形麼總有車。程場也。事社下、統得你手只灣一表成這不市開久：意好明然原老考手教整金是，發軍帶務害友麼溫從不年我兩容，更特來許。

女也在天她不原天是能系樣吸子真有跟那月腳代評我不！流別問；包看們很家要我由標小葉的便有種。活位學思一。引地設，門求得方、很愛麗得孩子，這我還孩少節利不天球冷香：在統孩多領進量力險去。代陽獨也現你現都有還形行完上親久故省工法；要出著常得、開有制學生。

隊上進歷理：也有有文回教究年。方能防北比微找根連國研我得樂轉術行、們沒力念車代費，科低則選能，頭該麗，講重了、德高假。格省的些合養下商的！怕影玩火今前始是令研年原施的訴親今造斷家：指買吃年戲父人青組合麼在希。供公紅究路？國笑元們定大問研出來人童期……色青這受了手經……花全觀夫十聲廠一府檢康？

法自就學養，步第已臺感人有樣光的常光和拉聯人海為一望基法去力場成在禮是美說需故年，她家得的濟進突眼的名快省、半陸速要所。所提兩辦師推小你料像讀：標華個苦；活與多那寫旅們……就能裡一構麼。變電家，吸到始球然天太念生間以身可從陽黃……告手式不以人起因我統境息常跑呢求天會來通，度不點升行共人我。"""

gc = pygsheets.authorize()

testing_list =[
    ['123','321','1234567'],
    [test_message, test_message, test_message]
]

# Open spreadsheet and then workseet
sh = gc.open('my new sheet')
wks = sh.sheet1

# Update a cell with value (just to let him know values is updated ;) )
wks.update_cell('A1', "Hey yank this numpy array")


# update the sheet with array
for i in range(0,20):
    print "writing %d times" % i
    wks.update_cells('A2', testing_list)

# share the sheet with your friend
sh.share("louiscklaw@gmail.com")
